data/run-B-long-context/bench_stdout_32768_trial3.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f52a23688b0>, trust_remote_code=False, seed=0, num_prompts=152, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=32504, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', header=None, max_concurrency=19, model='mistral-3-14B', input_len=None, output_len=None, tokenizer='mistralai/Ministral-3-14B-Instruct-2512-BF16', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/root/mktg3270_logs/bench_32768_trial3.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-70080b74-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-26 21:25:29 [config.py:389] Inferred from consolidated*.safetensors files torch.bfloat16 dtype.
INFO 08-26 21:25:30 [utils.py:90] Sampling input_len from [32503, 32503] and output_len from [256, 256]
WARNING 08-26 21:25:39 [datasets.py:683] Across all generated prompts, there were 1 more tokens than expected after decoding and re-encoding. This is expected due to the imperfect nature of the sampling procedure.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 19
100%|██████████| 152/152 [05:57<00:00,  2.35s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     152       
Failed requests:                         0         
Maximum request concurrency:             19        
Benchmark duration (s):                  357.63    
Total input tokens:                      4940609   
Total generated tokens:                  38912     
Request throughput (req/s):              0.43      
Output token throughput (tok/s):         108.81    
Peak output token throughput (tok/s):    502.00    
Peak concurrent requests:                21.00     
Total token throughput (tok/s):          13923.68  
---------------Time to First Token----------------
Mean TTFT (ms):                          5103.15   
Median TTFT (ms):                        3092.38   
P99 TTFT (ms):                           33712.51  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          154.98    
Median TPOT (ms):                        162.77    
P99 TPOT (ms):                           166.98    
---------------Inter-token Latency----------------
Mean ITL (ms):                           154.98    
Median ITL (ms):                         38.87     
P99 ITL (ms):                            590.19    
==================================================